{
  "paragraph1": "---<br>First off, I want to express my deepest and sincere gratitude to each and every one of you. The excitement was indescribable when I received a job offer from Grab after numerous rounds (>5) of interviews. Accepting this opporunity has been one of the proudest moments in my life. The continuous support and friendship I've experienced here have been amazing, made me enjoying every moment of my time at Grab.",
  "paragraph2": "I appreciate the exciting opportunities given during my time here. I was first welcomed with the warmth of broken pipelines, Azure migration, AWS migration and OVO ingestions along with many orphaned datasets ownership. Within a few short months, my hiring manager moved on, followed shortly by my new manager and colleagues. This left me as the only remaining GFG ADW member. However, my current manager, an expert in the data field was able to turn these challenges into opportunities, guiding me and the team to rebuild the entire ADW platform into what we have today. A special thanks goes to the Caspian team for their unwavering support during this period of transition and platform setup.",
  "paragraph3": "I want to let you all know how much I'm going to miss working with you. Our time together wasn't just about work, it was an exciting journey. Leaving behind the friendships and connections we've built makes this decision incredibly tough. Each and every one of you has made this experience truly memorable for me. While I am excited about the new chapter awaiting me, it is bittersweet to say goodbye to a place that has meant so much to me. Please know that I leave with a heavy heart, but with pride in all we've achieved together.<br><br>Shiwei",
  "827eaabb74575219c42595c8f9ab7dd5ef88934196cac9ed99ab807230aaac97": "Input your Grab's slack handle to view the goodbye messages.",
  "542f765889e86ec6be5aec106936aadf46687249ecc26a41804f7cf744e07e1c": "Firstly, thanks for the abalone (it was my favourite food)!! Your recognition of my efforts in the EDW Auto documentation project further motivated me to strive further in the AI field. Your leadership brought us to where we are today and thanks to the opportunity you've created to facilitate my professional growth and shape me into the person I am today.",
  "0f1f34e6bf874d2c3f6bdb22e21854b29f3de7e2b42e9d65d4c48649681d08d6": "Without your leadership, EDW wouldn't be what we are today. Though you often describe your concepts as 'simple and basic', but it's the whole new realm of knowledge to me and the team. Since you stationed me in the coding work that I really enjoys, you have given me the empowerment to push my own boundaries and limit to design and implement innovative crazy naive ideas.  The experience of working alongside you, especially during migration, has been incredibly enjoyable.",
  "b4bb286fa1456119b54c7b6edea840ca16b40a97c66e588408c0ee3a7f290120": "You're the only colleague that I put the most effort on to train and making sure that you're doing great in your work. Hope that all my guidance and leadership keep you on track to excel further in both Grab and data engineering field. You're picking up new things very fast and I have seen your drastic improvement in terms of decisino making and troubleshooting issues. All the best!",
  "0aa751fdcd16ae43566956897f95e0ff75d3b4021d15e6bba97e350980b37ff0": "Hey, though we didn't work much together but thanks for your time catching up with me. You're always the go-to person for any Digibank stuffs and you'll be the future leader of Digibank in the near future!",
  "46f171a6d0205372174e2aacd2ebf79e95f7b053445517ff70fd8e7baa560dfa": "You have a very cute and soft sound! You're always very serious and attentive during work. It feels very easy working along with you.",
  "d8f8780a49943a2caebe52d5ba79987271f50ba89544ae8a9f32e541b74ec83c": "Very happy to have a chance to work more with you before I leave. You're very energitic and cheerful which will help the team to move further! Good luck working more on the Airflows and do not hesitate to ask me if you're not sure about anything even after I leave. I will charge your manager the bill!",
  "8854d5c182e9c5f850dd246467243d0b8743e1d66b3e7177e23e0c88061e4791": "Hey, I am very happy with your new born baby and wish I have a chance to meet her one day. I was actually very eager to support and backup the works for both lending and GFG before I decided to move on. We can still catchup anydays when you're back!",
  "940e40bd272e9979d5a9c650c3a31d1a3d37f42ce26838d8905764b477984b68": "Good luck to both you and myself on our uncertain future! You'll definitely be successful with your cheerful behaviour. You always bring joys to the team and I really like listening to you when you talk!",
  "1c0f84898976612c246e1d30455b487ea37f63f44bde91986d5da089bc094313": "First of all, don't work on late night! It's a bad habit that I picked up and I don't think that this is good (feeling guilty becaue I am typing this at 2am). You're very hardworking, techincally strong and willing to sacrifice your own time to build something for the team. The FEDW team will always be great with your support at the backend!",
  "7fbc085ed6d646e50f1ee5f6b8e5229611e4580f3b25ea4f0727ab0ddb11f8b1": "You're my role model since the day you joined Grab. I envy your composure and having a very sharp mind. You complement my lack of experience in the SWE field and lighten up my path to success in the SWE domain. Without your advices, I wouldn't be what I am today!",
  "28895f4605920ceb70e27aa179f9f43ffc247cd6d09f001aa52b0f2a5c93c7fc": "My lunch buddy (because no one else I could find...) that talks to me everything else besides work! I learnt a lot of life and work experience from your advice. Besides that, you have a very high EQ and leadership experience which allows you to manage a team very well. You will be a very successful leader in Grab in the near future.",
  "db40f17ed4011c335731bac7e402743e20fdfb94e78df1b7070dc0253cf9f3b3": "You're very quite but sooooo steady in work. I also find that you're a very humourous person that seldom talks. Thanks for having 1 on 1 dinner with me and share me so many expert experience in the trading market. Love chatting with you and keep in touch!",
  "a838203247c2f423844ace52c4db4c3ab6d6615062642a4bc35b3cfe73228541": "Congratz on your wedding! We have a relatively near birthday date if I remember correctly (February!). Thaks for your contribution to start off the AWS migration work and also helping me out when I was enjoying my life at Morocco. You're an expert working with cross functional team and keep it up!",
  "786ed536adfa6c8b2a40b5e8a1cd33693d8eec31d1b4a4008117551f6fd461b5": "Haha you sound very cute and young. I can feel the energy and happiness everytime you talk that brings joy to the team. You have very high potential in the data engineering field given that you're still so young. You will definitely learn a lot throughout the years in Grab!",
  "c19043357bccd9bb9c59dbb627c9d3ff94bd58a032d8ec351bc3ea034b0d3dc0": "You're one of the best and steady colleagues that finishes your work with 100% focus. I seldom (maybe never) see you did anything wrong because you're sooooo detailed in terms of testing and analyzing data. You're a very vocal person which is a positive attribute required in the team. Pick up more complex project opportunities and share the high level ideas in a straightforward and concise manner will lead you further in your career growth.",
  "ee236b7c0eaeea72dcf38a6b0abc3790c78222895b135f3df89df0f4c4b0dd7f": "You're very calm and good at talking to people. I admire your contribution at Grab throughout all the years. Thanks for helping out the GFG works during the migration and do help to take care of GFG members after my departure.",
  "fe3000e28b6f1048ebf4c40b96e91d14e0b88065e4f2801d8d13ac824b87e19e": "You're one of the colleague that I put in most effort to train on. You're techincally strong and picking new things very fast. I saw your improvement and the willingness to learn and troublehoot issues yourself before reaching out to me. Do put in more time to design and architect the pipelines so that you're putting in all your effort on the correct direction! This takes time and experience to learn which you'll have to learn through reading how other's created their pipeline structures. All in all, I have confident that you'll be very successful and surpassing everyone in the team within a few years!",
  "c43674a53daf002fd67e4d5ec205b6eff1674f8eaae57f8d8bc65c174b19b3e6": "Not sure how many thanks I need to tell you because your support to me and the EDW team have been tremendous! You're always there for us and have full context on everything about Chimera. You're able to understand all our problems and ridiculous requests, just to give us an appropriate solution or advice. I have really learnt a lot from you and without you, I wouldn't be learning so much till date!",
  "696bf29f323fa390ffb6fff80d91a8503acd326a8077dc67a0cb54fc2d999ff8": "Thanks for the pictures! Do you know that your previous manager was my interviewer? Sadly that he wasn't here to see both of us being successful in Grab...",
  "d9cf680b585c917ab93b37d08627a7f3818cca53612220bc1cb0e6d818492efd": "Thanks for always acknowledging our hardwork and giving credits to us. You've also supported us a lot during the days when the GFG team doesn't have a manager. I was so nervous in the early days without any context and you've always jumped in the support us with your expertise in GFG and FPNA.",
  "19b478b76155d82ea5e51e967ca2d23e5074b0c069993800696b4ac8f0a35b38": "You were one of my interim manager! Thanks for listening to my career aspiration and gave me the choice to enter data engineering. I really like my job soooo much and it was due to your advice and decision!",
  "650745741f7cd2873cd4163ea72a3d095ff8f1f3ab7e4a766443026c2808c94a": "Hey, nothing much to say! You're both my enemy and friends. Thanks for bringing me into your team and the outings. You have a lot of funny personal stories which brings a lot of joy and fun to your team. Do keep in touch and meetup also even after my departure. Also thanks for bringing me into toastmaster which indeed was a very great experience!",
  "bbc0c86368d51980b059195f7148a0cab91108d2fc7faa208f20d4db261c792c": "You're so energitic that you laugh on everything that we said. Let's hangout and drink more often so that you can share more of your secrets to us hehe! Didn't know that you have a yoga class which I would definitely join if I knew it earlier!",
  "c038a7f69e7d6f26df44c37e4cab4de6d718c8706089062318e6f42e42e11ade": "You're the first person I know from your team and we worked a lot together on GFG recon stuffs (headache man!). Thanks for introducing me to your team and hope you enjoy your time after marriage and do let me know when you have a kid!",
  "d649794090980e5381ceed93ba7b2782f6ba3759a975ff7bae2c36ad42acfa55": "You're a very funny person that always gives a sudden lame joke. Didn't work much with you but know you more through outings with your team.",
  "59bc9131c3c0f343d0c0851924b4a66d3155954adfca7d35b6ff67037fa06dd7": "Speak more and be crazy like us haha! Your presentation in toastmaster was awesome and I hope that I could do it like you in the future.",
  "6d0d0b491d3a6a100d27e5430f0565811d8dda31c5a35d266e04ce9962947b8d": "Thanks for supporting the GFG ADW team on the Azure platform with my ex manager. I didn't have much knowledge or context during that time and without you, things would break or gone unattended. Good luck with your career in Grab!",
  "98deb36f91722f166cc08716c5bbb583819d5d07b8953db3a8c3c0be06a4ac90": "x",
  "b48aced0bc6c4023b8a4b3e801ac3eab3b994f8cf20780c15565ede80f29e789": "x",
  "de969301ae44e449cc38b62507a530e404446edae59a3d311defc3a7266a55b5": "x",
  "9a9f2d4d1f0b533212e22bdb052b150ea70aca70e4cfdb6c3d7a69b633349054": "x",
  "dfcec414265f8437403921927e8be827aa21e641904c756b14b9d0ba58039909": "x",
  "8340f23ba0d951d9c13d534aa4ef9521452e11b6ce9278e7d241eac95a934c86": "x",
  "4ae3014a82cfc2053f1967be7cba8be1795a498e758e7305046c9b3d7c98cafb": "x",
  "31d3ef0c755b725766f6f32cd9256f29f54346432fb297d7d2cbea2d0851472a": "x",
  "200776fba68cdc3179d04971ce1af80ae77743b1da2d1c76fa07ace92588ca68": "x",
  "9a8c9bc7f810a9fcdc62247d60f13787d12273097355269e1f41f694964f03ad": "x",
  "178751623f89eaae5c58fa5d2715b9187862e4c40535e5b53fff12f1075af35b": "x",
  "24477027be31895a66f25b6ffa58aa0df27910f3d87bee206a32d21abf49814a": "x",
  "cc29b59c62a2d812a604d7de4dde131af44fe567ba0035ad38f359b5a098fc56": "x",
  "62a16d32686bc0f9df155fbccbda0cc2fb91eca0a69df6850d3910be3d7efa25": "x",
  "b032535515c7921b3ca21cdecb6546a6cb10781e04c6e8420c33e023be546ac5": "x",
  "ee990de6ebcf86744f9a76ecf0b822df9bb83fbab2bba6390e65a4f08fc9390f": "x",
  "865b77b850fde867ae5a18dbac7edfbdde0a076502e5f293972d08e1d9c4a719": "x",
  "44a20442bf5662e531a81b5b3c4051a10a95bd9098a55a48d1b93956291128b5": "x",
  "a1a6b98afc37073e4b476ab2caec2103142102064b845f84df0e0b711d9761ad": "x",
  "d7157cfecb0405b6b2bfa5bb6b4548f1094c1ddc82ed6cfcbddbf29b3490236a": "x",
  "b56bb2bc3b15238514ffafcc575714f72ed1ef7b7a685165f096bcee4d7d2caa": "x",
  "1545be279000ccb0547de948b8b2436dd0c78c75bf613f31cce0135829f5de4e": "x",
  "b0f58a1c504ea3870be7de4ff15a38faab758cf2fcea37bf1f88e5155892f488": "x",
  "05def886678919c8fe0bd88988f8d93249ee3acbb08bbb3e517dda5cc1676cb8": "x",
  "51d2e2487d6db081edce2386ec672504efa92b6979429c3943c44028c7fee408": "x",
  "9783df04eb9f270ef93ecdffe56af3e25256d04639ed236a4b1594ff9945b79e": "x",
  "78af7225a3833b1e43018733974245f2c33be437cc386cf1a95e3933e184fa63": "x",
  "83e5e5b200fe1d20c9ac714ec6769fe83a2812af6a095325d759d6906aa6de52": "x",
  "50b3ef2cc65bd82c80071d6fb5d6d3edf386e8092225e48f381ea50d7093c3ea": "x",
  "0ddb6612b7d667d6aceb14c6fd1ee1c9c3d102cbdc7f707768344774132cc7cc": "x",
  "aa59df4b8141d103a33b2bda613bc389576949c16382341cdb2ec7c39e4fde3c": "x",
  "265a42c90d7bb1ea523a30389c916e608380152d3bdc10ead81bf06ea8a96308": "x",
  "e234e3fed69a16dcaa61b9d9b4514481476f1caa8ee50aeaba665fc12b3707ce": "x",
  "d6ae0b64f2521c8200b2f74a4d5aff05191e00f0bd5ba029f44b1b957858ce8b": "x",
  "e9e42abeabf4ab73f132338ea40f99c578d833ae52d12af50744c9d224ce9045": "x",
  "0375701904927e43de6c3277c26b0d04b4cee31bad8eb65ae6bd8e833c8af5c1": "x",
  "b1d5d0e7533ffbab57a8c71cc209bb6dc6cc154276446cc3cc7505a6aaf89124": "x",
  "3c05b18b1e2b0f169e15bcbff28965df2c3a7cead41d71146294630ef99d0c75": "x",
  "482a5a48df9fd87f83964d740122d67d02e7170aa186c0d298467def3a918fe4": "x",
  "2c0a7fd84ae357901ed5a5a911f50f25b7577a221beee942234304347f31f201": "x",
  "f2b212cbc4daab64624650818fdccbd542b7a8fa32eec1c342c1688f551779f3": "x",
  "e0f75e8cb05ee2fb7d1ff8b87e6474c766bde9d2a9a937701b953af319dbe0d2": "x"
}